cmsis-svd/cmsis-svd/data/Infineon/psoc4100sp256kb.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MCA0</name>
      <description>Motor Control Accellerator</description>
      <headerStructName>MCA</headerStructName>
      <baseAddress>0x402C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>4096</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CONFIG</name>
          <description>IP Configuration Register</description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0x80000001</resetMask>
          <fields>
            <field>
              <name>BLOCK</name>
              <description>Specify whether a SW read access of DIV_QUOTIENT, DIV_REMAINDER or SQRT_ROOT should block and result in bus wait states while operation is ongoing.
0: Read access returns immediately. It will return stale result if current operation doesn't complete.
1: Introduce wait state if read access is issued while operation is ongoing. It ensures SW to get the calculation result of current operation.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ENABLED</name>
              <description>Enable IP</description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTL</name>
          <description>IP Control Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x77</resetMask>
          <fields>
            <field>
              <name>START_DIVIDE_LEVEL</name>
              <description>Start Divide operation Level - Use to continuously enable Divide operations.  DIV_DIVIDEND must be loaded prior to DIV_DIVISOR. The divisison begins upon loading DIV_DIVISOR.  Use either this bit OR CTL.START_DIVIDE_PULSE, but not both simultaneously.
0:  DIVDE.START is disabled. This is the required value if CTL.START_DIVIDE_PULSE is used.
1: DIVIDE.START is asserted continuously.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>START_DIVIDE_PULSE</name>
              <description>START_DIVIDE_PULSE: Start Divisor operation - a 1 clock pulse is sent to the DIVIDE.START input. Use either this bit OR CTL.START_DIVIDE_LEVEL, but not both simultaneously.
0: No Opereration.
1: Create 1 clock pulse to DIVIDE.START</description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HOLD_DIVIDE</name>
              <description>Hold Divide operation.- Pauses the calculation process. If asserted while caculation is in process the STAT.DIVIDE_COMPLETE to remain low until HOLD is removed. Upon removal - the operation will finish and STAT.SQRT_COMPLETE will assert nominally.</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>START_SQRT_LEVEL</name>
              <description>Start Square Root operation Level - Use to continuously enable Square Root operations.  The divisison begins upon loading SRQ_RADICAND.   Use this bit OR CTL.START_SQRT_PULSE, but not both bits simultaneously.
0:  SQR.START is disabled. This is the required value if CTL.START_SQRT_PULSE is used.
1: SQR.START is asserted continuously.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>START_SQRT_PULSE</name>
              <description>START_SQRT_PULSE: Start Divisor operation - a 1 clock pulse is sent to the SQR.START  input.  Use this bit OR CTL.START_SQRT_LEVEL, but not both bits simultaneously
0: No Opereration.
1: Create 1 clock pulse to SQR.START</description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>HOLD_SQRT</name>
              <description>Hold Square Root operation.- Pauses the calculation process. If asserted while caculation is in process the STAT.SQRT_COMPLETE to remain low until HOLD is removed. Upon removal - the operation will finish and STAT.SQRT_COMPLETE will assert nominally.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>STAT</name>
          <description>IP Status Register</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x13</resetMask>
          <fields>
            <field>
              <name>DIVIDE_COMPLETE</name>
              <description>Divide Operation Complete - This bit is a reflection of the calculation time after DIVIDE.START de-asserts. 
0: Divide operation is ongoing.
1: Divide operation completes and ready for next start event. 
Note that this bit will assert in 8 clk_sys cycles after IP is enabled, even there is no start event.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DIVIDE_BY_0</name>
              <description>DIV_DIVSOR equals 0</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SQRT_COMPLETE</name>
              <description>Square Root Operation Complete - This bit is a reflection of the calculation time after SQRT.START de-asserts. 
0: Square Root operation is ongoing.
1: Square Root operation completes and ready for next start event. 
Note that this bit will assert in 4 clk_sys cycles after IP is enabled, even there is no start event.</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV_DIVIDEND</name>
          <description>32 bit Dividend</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVIDEND</name>
              <description>Dividend</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV_DIVISOR</name>
          <description>32 bit Divisor</description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVISOR</name>
              <description>Divisor - should not be set to 0 or STAT.DIVIDE_BY_0 will set. If CTL.START_DIVIDE_LEVEL is used, then the divide operation starts once SW writes this register, therefore this register must be programed after DIV_DIVIDEND. After 8 clk_sys cycle, the result will be stored in DIV_QUOTIENT and DIV_REMAINDER.  Note that when CTL.START_DIVIDE_LEVEL is asserted, this causes a single DIVIDE.START pulse to begin the calculation.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV_QUOTIENT</name>
          <description>32 bit Quotient</description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUOTIENT</name>
              <description>Quotient. The result will remain unchanged until the next divider operation starts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIV_REMAINDER</name>
          <description>32 bit Remainder</description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REMAINDER</name>
              <description>Remainder. The result will remain unchanged until the next divider operation starts.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQRT_RADICAND</name>
          <description>Square Root Source Value</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RADICAND</name>
              <description>If CTL.START_SQRT_LEVEL is used, then the square root operation starts once SW writes this register. After 4 clk_sys cycles, the result will be available in SQRT_ROOT. If CTL.START_SQRT_PULSE is used, the result will be available 4 clk_sys cycles after the pulse occurs. Note that when CTL.START_SQRT_LEVEL is used, a 1 clock pulse will be sent to SQR.START to begin the calculation.</description>
              <bitRange>[31:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SQRT_ROOT</name>
          <description>Square Root Result</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFFFF</resetMask>
          <fields>
            <field>
              <name>ROOT</name>
              <description>The result will keep unchanged until next square root operation starts .</description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
